[
    {
        "id": 1,
        "title": "Zohran Mamdani Sworn In as NYC Mayor at Historic Subway Station",
        "category": "International",
        "description": "The first Muslim Mayor of New York City takes office with a promise to transform the government for the working class.",
        "content": "Zohran Mamdani became the Mayor of New York City on January 1, 2026. In a historic ceremony held at a decommissioned subway station, Mamdani took his oath on a Quran. He promised an 'audacious' administration focused on housing and worker rights as the city enters a new era.",
        "image": "https://i.ibb.co.com/Mx5SVykD/images-2.jpg",
        "date": "Jan 2, 2026",
        "isFeatured": true,
        "author": "Sarah Jenkins"
    },
    {
        "id": 2,
        "title": "Bangladesh Trialing Postal Ballots for Upcoming 2026 Elections",
        "category": "National",
        "description": "For the first time in history, over 1.2 million expatriates are registering to vote via mail.",
        "content": "The Election Commission of Bangladesh has officially started the facilitation process for postal ballots. This initiative aims to include millions of Bangladeshi citizens living abroad in the democratic process for the first time in 2026.",
        "image": "https://i.ibb.co.com/k65HMGnQ/Bangladesh-Elections-78229-jpg-3871c.jpg",
        "date": "Jan 2, 2026",
        "isFeatured": false,
        "author": "Tanvir Rahman"
    },
    {
        "id": 3,
        "title": "Switzerland Bar Fire: 40 Dead in New Year's Eve Tragedy",
        "category": "International",
        "description": "Investigations are underway at the Crans-Montana ski resort after a devastating blaze during a New Year party.",
        "content": "A tragic fire at a luxury bar in the Swiss Alps has left approximately 40 people dead. Victims are still being identified as the international community sends condolences to Switzerland on the second day of 2026.",
        "image": "https://i.ibb.co.com/k2G3cWBw/Suisse-new.jpg",
        "date": "Jan 2, 2026",
        "isFeatured": false,
        "author": "Robert Miller"
    },
    {
        "id": 4,
        "title": "Bulgaria Officially Adopts the Euro as National Currency",
        "category": "Business",
        "description": "Bulgaria becomes the 21st member of the Eurozone despite protests and political debate.",
        "content": "On January 1, 2026, Bulgaria transitioned from the lev to the euro. While the government celebrates the economic integration, many citizens expressed concern over potential price inflation in the Balkan nation.",
        "image": "https://images.unsplash.com/photo-1580519542036-c47de6196ba5?q=80&w=1200&auto=format&fit=crop",
        "date": "Jan 1, 2026",
        "isFeatured": false,
        "author": "Emma Watson"
    },
    {
        "id": 5,
        "title": "Usman Khawaja Announces Retirement After Final Ashes Test",
        "category": "Sports",
        "description": "The veteran Australian opener will bid farewell to international cricket at the Sydney Cricket Ground.",
        "content": "Australia's Usman Khawaja has confirmed he will retire from international cricket after the fifth Ashes Test in Sydney on January 4, 2026, ending an illustrious 15-year career.",
        "image": "https://images.unsplash.com/photo-1531415074968-036ba1b575da?q=80&w=1200&auto=format&fit=crop",
        "date": "Jan 2, 2026",
        "isFeatured": false,
        "author": "Michael Owens"
    },
    {
        "id": 6,
        "title": "Bangladesh Honors Mushfiqur Rahim for 100 Tests Milestone",
        "category": "Sports",
        "description": "The legendary wicket-keeper batter becomes the first Bangladeshi to play 100 Test matches.",
        "content": "In a grand ceremony at the Sher-e-Bangla National Stadium, the BCB honored Mushfiqur Rahim. His contribution to Bangladesh cricket has been pivotal in the team's rise on the global stage.",
        "image": "https://i.ibb.co.com/0jwMT3mB/images-3.jpg",
        "date": "Jan 2, 2026",
        "isFeatured": false,
        "author": "Arif Chowdhury"
    },
    {
        "id": 7,
        "title": "Samsung Acquires FläktGroup to Lead Global HVAC Market",
        "category": "Technology",
        "description": "The tech giant expands its footprint into sustainable building solutions with this major acquisition.",
        "content": "Samsung Electronics has completed its acquisition of FläktGroup. The move signals a strategic shift towards energy-efficient climate control systems as global warming remains a critical focus in 2026.",
        "image": "https://images.unsplash.com/photo-1581092160562-40aa08e78837?q=80&w=1200&auto=format&fit=crop",
        "date": "Jan 2, 2026",
        "isFeatured": false,
        "author": "Alex Rivera"
    },
    {
        "id": 8,
        "title": "Dhaka's Air Quality Improves Following Unseasonal Showers",
        "category": "National",
        "description": "Recent rain across the capital brings relief from winter haze and dust particles.",
        "content": "The AQI in Dhaka dipped to 116 today after light to moderate rain. Citizens enjoyed the fresh air, although meteorologists warn that temperatures may drop further in the coming week.",
        "image": "https://i.ibb.co.com/Zp3kd8my/dhaka-air-20240420105901-1.png",
        "date": "Jan 2, 2026",
        "isFeatured": false,
        "author": "Sumi Akhter"
    },
    {
        "id": 9,
        "title": "US Urges China to Stop Military Pressure Near Taiwan",
        "category": "International",
        "description": "Regional tensions rise as China conducts large-scale drills in early 2026.",
        "content": "The US Department of State has called for 'restraint and dialogue' following Chinese military exercises near Taiwan. Both superpowers are watching the situation closely as 2026 begins.",
        "image": "https://i.ibb.co.com/fGNt65FG/images-4.jpg",
        "date": "Jan 2, 2026",
        "isFeatured": false,
        "author": "Dr. James Carter"
    },
    {
        "id": 10,
        "title": "Fuel Prices in Bangladesh Reduced by Tk2 Per Liter",
        "category": "National",
        "description": "Diesel, petrol, octane, and kerosene prices drop as part of a new government pricing formula.",
        "content": "In a move to ease public cost of living, the Ministry of Power and Energy reduced fuel prices. The adjustment comes as global oil prices stabilize in the first week of 2026.",
        "image": "https://images.unsplash.com/photo-1532009324734-20a7a5813719?q=80&w=1200&auto=format&fit=crop",
        "date": "Jan 1, 2026",
        "isFeatured": false,
        "author": "Farhan Zaki"
    },
    {
        "id": 11,
        "title": "India Asks Pakistan to Release 167 Indian Prisoners",
        "category": "International",
        "description": "Bilateral tensions continue as New Delhi seeks repatriation for fishermen in Pakistani custody.",
        "content": "The Ministry of External Affairs in India has urged Pakistan to expedite the release of its citizens who have completed their jail terms. Consular access is also requested for 35 others.",
        "image": "https://images.unsplash.com/photo-1529107386315-e1a2ed48a620?q=80&w=1200&auto=format&fit=crop",
        "date": "Jan 2, 2026",
        "isFeatured": false,
        "author": "Angela Merkel"
    },
    {
        "id": 12,
        "title": "Forex Reserves in Bangladesh Hit 3-Year High",
        "category": "Business",
        "description": "Remittance inflow crossing $3 billion in December stabilizes the economy.",
        "content": "Bangladesh's central bank reported a surge in foreign exchange reserves thanks to record-breaking remittances from expatriates. This provides a much-needed buffer for the national economy.",
        "image": "https://i.ibb.co.com/VWWht8XC/reserve-graph-1-1593015480066.webp",
        "date": "Jan 1, 2026",
        "isFeatured": false,
        "author": "Kazi Ishtiaque"
    },
    {
        "id": 13,
        "title": "Quantum Supremacy: AI Defenses Mitigate Huge Cyber Attack",
        "category": "Technology",
        "description": "An automated AI grid blocks a global botnet targeting banking systems in minutes.",
        "content": "Cybersecurity firms reported a massive DDoS attack on New Year's day. However, AI-driven defense protocols neutralized the threat before any financial data was breached.",
        "image": "https://images.unsplash.com/photo-1550751827-4bd374c3f58b?q=80&w=1200&auto=format&fit=crop",
        "date": "Jan 2, 2026",
        "isFeatured": false,
        "author": "Kevin Mitnick"
    },
    {
        "id": 14,
        "title": "New Tobacco Tax in India to Take Effect from February",
        "category": "Business",
        "description": "Central Excise Amendment Act 2025 specifies higher rates on cigarettes and tobacco products.",
        "content": "The Indian government has notified that new excise duties will start next month. Analysts predict a 10-15% rise in the price of premium tobacco products.",
        "image": "https://images.unsplash.com/photo-1527181152855-fc03fc7949c8?q=80&w=1200&auto=format&fit=crop",
        "date": "Jan 2, 2026",
        "isFeatured": false,
        "author": "Janet Yellen"
    },
    {
        "id": 15,
        "title": "Ireland Posts 270 Runs on Opening Day of Sylhet Test",
        "category": "Sports",
        "description": "A strong batting performance puts the visitors in a solid position against Bangladesh.",
        "content": "At the Sylhet International Stadium, Ireland showed resilience on Day 1. Bangladesh's spinners struggled to find breakthroughs as the Irish batters capitalized on the pitch conditions.",
        "image": "https://images.unsplash.com/photo-1531415074968-036ba1b575da?q=80&w=1200&auto=format&fit=crop",
        "date": "Jan 2, 2026",
        "isFeatured": false,
        "author": "Mahbubur Rashid"
    },
    {
        "id": 16,
        "title": "Turkmenistan Legalizes Crypto Mining to Shift Economy",
        "category": "Business",
        "description": "The isolated nation seeks new revenue streams through blockchain and digital currency.",
        "content": "In a surprise move, Turkmenistan has legalized crypto mining and exchanges. The decree aims to modernize the national economy and attract tech-savvy foreign investors.",
        "image": "https://images.unsplash.com/photo-1518546305927-5a555bb7020d?q=80&w=1200&auto=format&fit=crop",
        "date": "Jan 2, 2026",
        "isFeatured": false,
        "author": "Yuki Tanaka"
    },
    {
        "id": 17,
        "title": "Peru Approves Emergency Overhaul of Petroperu Oil Firm",
        "category": "International",
        "description": "The state-owned company faces restructuring to avoid financial collapse.",
        "content": "The Peruvian government has greenlit an emergency plan for Petroperu. This includes new management and fiscal measures to stabilize the energy provider amidst rising costs.",
        "image": "https://images.unsplash.com/photo-1518709268805-4e9042af9f23?q=80&w=1200&auto=format&fit=crop",
        "date": "Jan 2, 2026",
        "isFeatured": false,
        "author": "Sophia Loren"
    },
    {
        "id": 18,
        "title": "South Korean President Lee Jae-myung to Visit Beijing",
        "category": "International",
        "description": "A pivotal summit with Xi Jinping aims to strengthen regional ties in 2026.",
        "content": "The upcoming visit is seen as a major diplomatic effort to balance relations between the US and China. Security and tech trade will be the top items on the agenda.",
        "image": "https://i.ibb.co.com/SwjCBxKN/8ba7d12a-c662-4bc0-a60e-022b9957ae9f-ab2b4e50.webp",
        "date": "Jan 2, 2026",
        "isFeatured": false,
        "author": "Chris Evans"
    },
    {
        "id": 19,
        "title": "Massive Protests in Iran Over Rising Cost of Living",
        "category": "International",
        "description": "Demonstrations spread across southwestern cities as citizens demand economic relief.",
        "content": "Two people have been killed in recent clashes. The protests highlight growing frustration with inflation and unemployment in Iran as the new year begins.",
        "image": "https://i.ibb.co.com/9Cdnc2k/e0e2b6e246051d5b1ea24a4ff9391d49.avif",
        "date": "Jan 1, 2026",
        "isFeatured": false,
        "author": "Angela Merkel"
    },
    {
        "id": 20,
        "title": "Zaima Rahman Remembers Grandmother Khaleda Zia with Poetry",
        "category": "National",
        "description": "The granddaughter of the late former PM shares a touching tribute on social media.",
        "content": "Following the passing of Khaleda Zia, tributes continue to pour in. Zaima Rahman shared a poem by Kazi Nazrul Islam, which has been widely shared by supporters across Bangladesh.",
        "image": "https://images.unsplash.com/photo-1529156069898-49953e39b3ac?q=80&w=1200&auto=format&fit=crop",
        "date": "Jan 2, 2026",
        "isFeatured": false,
        "author": "Mridul Islam"
    }
]